{"T1001": {"title": "Clowntown: a look at software engineering on the other side of the chasm", "abstract": "Multiple authors in the scientific computing literature have described a \"chasm\" between methodology and practice in scientific computing and in commercial software engineering. Does this chasm exist? Is the industry's grass actually any greener? In this talk I reflect on the level of software engineering maturity found in commercial organisations during my career, including the case study that motivated the talk title: engineers at Facebook routinely refer to their own code as \"clowntown\" in acknowledging the hacks, shortcuts, and mistakes in one of the world's most high profile software systems. This talk is for anyone interested in discovering what they can learn from industry software practices, and will be light-hearted and thought-provoking in equal measure.", "name": "Graham Lee", "institution": "University of Oxford", "format": "Talk"}, "T1003": {"title": "How hard can it be to add a button? Managing customer expectations in research software projects", "abstract": "Researchers are very good at generating ideas for projects and for features they would like in software. However, in many cases, they don’t have a software engineering background and therefore have a limited understanding of how much work is required to implement the software. This difference in understanding is a potential source of confusion and can lead to poor project outcomes and disagreements between the research team and software team. It’s important for the software team (or software engineer if working solo) to manage the expectations of the research team from the early stages of a project. In this talk I will discuss this challenge in more detail and share some potential strategies for managing expectations that should help to result in a more successful project.", "name": "Matthew Machin", "institution": "University of Manchester", "format": "Talk"}, "T1004": {"title": "Changing from in-person to online training during the Covid-19 pandemic", "abstract": "The United Kingdom Chemistry and Aerosol (UKCA) [1] model provides composition modelling capability to the Met Office Unified Model [2] and is a key component of the UKESM1 Earth system model [3]. Training courses on how to use UKCA have been run in-person annually since 2013 using national HPC resources such as HECToR [4] and ARCHER [5]. However, due to the global Covid-19 pandemic this course needed to be delivered virtually for the February 2021 training event.\n \nIt is possible to use a Virtual Machine (VM) environment for UKCA training (Abraham et al., 2018 [6]), which meant that the JASMIN Cloud [7] could be used to provide the students access to suitable configurations of the UKCA model. This method has several advantages over the HPC approach, such as a remote desktop option and a reduction in the number of required usernames and passwords. Modifications to the VM set-up were required, and the Ansible playbooks used are available via GitHub [8].\n\n[1] https://www.ukca.ac.uk/\n[2] https://www.metoffice.gov.uk/research/approach/modelling-systems/unified-model/index\n[3] https://ukesm.ac.uk/\n[4] http://www.hector.ac.uk/\n[5] https://www.archer.ac.uk/\n[6] https://doi.org/10.5194/gmd-11-3647-2018\n[7] https://help.jasmin.ac.uk/category/65-for-cloud-tenants\n[8] https://github.com/theabro/ukca-playbook", "name": "Luke Abraham", "institution": "National Centre for Atmospheric Science & Department of Chemistry, University of Cambridge", "format": "Talk"}, "T1005": {"title": "Adding value to HPC codes with CI", "abstract": "Traditionally the function of CI has generally been constrained to the running of build scripts and unit/integration tests. This is undoubtedly valuable in and of itself, but in HPC contexts the benefits of CI can be much more profound. We present a pipeline that runs permutations of several our benchmarks on an arbitrary number of supercomputers upon every update to our master branch. This pipeline encapsulates its own logic: for example, the ability to follow up with lead developers with profiler output when performance is noticed to have suddenly deteriorated. That is, we set out a pipeline that not only informs the user that an issue occurred in a job, but also provides developers with the tools and insights necessary to fix it quickly. This workflow can be used to assess code performance characteristics comparatively across a range of hardware in an automated fashion. Data is thereby accumulated that can aid us in the task of honing our code to specific hardware domains and coordinating where job scripts are issued on a day-to-day basis.", "name": "Mark Turner", "institution": "Durham University", "format": "Talk"}, "T1007": {"title": "Publishing your Software Project (with the Journal of Open Source Software)", "abstract": "Publishing your research software project in a peer-reviewed journal can have multiple benefits. This includes: increasing the visibility of your work, easily quantifiable recognition and credit through e.g. citation counts, and using the publication as an indicator for software reliability. Last but not least, the peer review process should lead to *better quality software*.\n\nIn recent years, several new research software journals have emerged. In this talk, after outlining the various benefits gained from publishing research software, I will focus on the Journal of Open Source Software (JOSS). Drawing on my personal experience of publishing in and reviewing for JOSS, I will reflect on how this has improved the quality of software I write, and how we may use the process of software publication to support others' development. I will outline the unique JOSS publishing model that challenges the more \"traditional\" journals, including their fully open, Github-based peer review process. Hopefully you will leave the talk knowing if your work falls within the journal scope, and understanding how to successfully submit your software project.", "name": "Lucy Whalley", "institution": "Northumbria University", "format": "Talk"}, "T1008": {"title": "Generating Synthetic Datasets for Image Guided Surgery & Medical Imaging", "abstract": "A majority of researchers working with medical imaging/image guided surgery (IGS) are involved with machine learning in some form (registration, segmentation, stereo reconstruction, classification etc). However, the lack of sufficiently large amounts of application specific training data is a major blocker for development, with training sets limited to 10s or 100s of examples for some applications.\n\nIn addition, the time-consuming process of manually labelling data is especially challenging for medical data, as labelling complex intraoperative scenes (i.e. images from inside the body) or radiological data typically requires the intervention of a trained clinician. The wider computer vision community has benefited from large open sourced datasets, including both real (e.g. ImageNet, KITTI) and simulated (e.g. Scene Flow, Virtual KITTI) and the use of simulated data can provide tangible benefits for the IGS community.\n\nThe Unity development environment has recently expanded into the field of synthetic machine learning data, with the launch of the Unity Perception package, providing a framework for generating large datasets by randomising parameters within a scene (model size/shape/position, textures, colour, lighting effects, camera properties etc); this talk will give an overview of my recent work to generate large scale datasets (10s or 100s of thousands) for machine learning applications in image guided surgery.", "name": "Thomas Dowrick", "institution": "UCL", "format": "Talk"}, "T1010": {"title": "No Computing on a Dead Planet", "abstract": "Climate change is here. To reduce the impacts we must urgently reduce our carbon dioxide emissions. Operating computers is a significant and growing contributor to these emissions. Obviously facilities managers have lot of influence on how energy efficient computing can be. But, not all heroes wear capes. As RSEs we have an opportunity to improve the energy efficiency of the software we write.\n\nThis talk will explore the issue and provide pointers to resources and concrete tools and techniques to reduce the energy impact of the software we write.", "name": "Christopher Edsall", "institution": "University of Cambridge", "format": "Talk"}, "T1011": {"title": "Compartmental Modelling for tracking the spread of COVID-19 in Wales OR: How I learned to stop worrying and tolerate R.", "abstract": "In this talk we will discuss the current work of the  Supercomputing Wales RSE team\nbased at Swansea University on simulating the impact of various lock down measures\non the spread of COVID-19 across Wales.\nThis work this work forms part of the reports from the Welsh technical advisory\ngroup who provide scientific advice to the Welsh Government. This is\nused to assist them in making decisions related to the pandemic by determining\nthe likely impact of various lock down scenarios on cases, hospitalisations,\ndeaths etc under a varying set of assumptions. This then provides the central epidemic\nscenarios for staffing allocation decisions at Health Board Intensive Care Units,\nWelsh Ambulance Service and Test Trace Protect.\nWe will discuss some technical details of the current model, some of the challenges\nwe have faced along the way and some thoughts on R as a programming language from\nthe perspective of a relative newcomer.", "name": "ben thorpe", "institution": "swansea university", "format": "Talk"}, "T1012": {"title": "University of Sheffield Research Software Survey (2020)", "abstract": "Software is an important part of research and a key research output. We conducted a survey at the University of Sheffield in October 2020, similar to previous surveys conducted nationally and at the University of Southampton, to find out about how software was being used in research.\n\nOur preliminary results indicate that, of 382 respondents, 92% used research software and 65% reported that it was essential to their research. We found 69% of respondents (who responded to the specific question) did not feel they had sufficient training to develop reliable software. We found that while 45% of respondents involved in writing funding applications expected to write software, 40% of these did not request funding for this.\n\nThis indicates that there is a need to investigate why respondents feel that they lack training and are not costing software development on funding applications as much as they might. It likely means that a greater availability of training and better communication of the role of the RSE team are needed.\n\nHere, we will report our major findings and our recommendations for the future based on these. We will explain our research methods (and make suggestions for improvements) and how we have used Python-based tools to analyse the data.", "name": "Robert Turner", "institution": "University of Sheffield", "format": "Talk"}, "T1016": {"title": "GPU-Accelerated Spectral Methods in Python: A Case Study", "abstract": "The programming language Python is often considered too slow for high-performance computing (HPC), particularly when compared to lower-level (but harder to use) languages, Fortran and C++. However, the development of Python libraries which expose the extreme parallelism of accelerators, such as graphical processing units, allows the construction of comparably fast simulation code while also reaping the benefits of an easier to use language.\n\nIn this presentation I will describe the (continuing) development of Melvin, a 2D, pseudo-spectral, computational fluid dynamics (CFD) solver framework specifically designed to target NVIDIA accelerators through the use of the library CuPy. The code has been developed with software sustainability in mind and I shall describe how the quality of the code has been improved through good use of version control, unit tests, continuous integration and decoupled design. In particular, I will demonstrate the extensibility of the code by presenting results from a number of different applications, namely the Kelvin-Helmholtz instability, thermohaline staircase formation, the MHD resistive tearing instability, and Rayleigh-Benard convection, with some comparisons to other codes. Preliminary results suggest that (without significant optimisation) Melvin is within around 50% of the runtime of a comparable C++ code.\n\nMelvin provides an example of the kind of CFD possible with modern, GPU-accelerated Python and gives an indicator of the expected performance. While Python cannot be expected to easily achieve the same performance as well-tuned codes written in more traditional HPC languages, it offers a simple way to prototype algorithms and solvers, to learn about accelerated computing, and even to provide a low-effort accelerated solution, particularly for existing codes developed in Python.\n", "name": "Jamie Quinn", "institution": "University College London", "format": "Talk"}, "T1017": {"title": "On Impact of RSEs Collaboration with Researchers: Refactoring Statistical R Packages Case Study", "abstract": "On Impact of RSEs Collaboration with Researchers: Refactoring Statistical R Packages Case Study <-->\n\nNaeem Khoshnevis, PhD\nMahmood M. Shad, PhD\n\n<-->\n\n* FASRC, Harvard University\n\n<-->\n\nThe two main ingredients for data-driven premium research, including high-resolution data and computational resources, are more accessible than before. However, aggregating these two resources has been a big challenge for many research groups. Computational technology is growing rapidly and demands a dedicated team to upgrade the research software for new platforms and data sets. In this study, we discuss our experience in a highly productive collaboration with researchers from the Biostatistics department at Harvard T.H. Chan School of Public Health. In particular, we present an R package (CausalGPS) refactoring process with its technical details and faced challenges. CausalGPS is an R package to conduct causal inference research with continuous exposure. The refactoring process includes profiling, modularized implementation, unit testing, documentation, continuous integration, reviewing numerical algorithms for efficient performance, harnessing computational power as much as possible, and training researchers to become part of the software development lifecycle. In this unique experience, we faced numerous challenges, including the best practices in building healthy communications between RSEs and researchers, documentation, and keeping the balance between the best software engineering practices and commonly used R code development approaches. According to this collaboration, an outstanding achievement can be gained by such collaboration. \n", "name": "Naeem Khoshnevis", "institution": "Harvard", "format": "Talk"}, "T1018": {"title": "Testing HPC C++ software with GoogleTest: adjusting the test framework for distributed-parallel tests using MPI", "abstract": "Unit testing is one of the key ingredients to ensure code quality.\nA commonly used test framework for C++ software is the GoogleTest library (https://github.com/google/googletest).\nIt provides interfaces to quickly set up and use unit tests, to organize them in test suites and to define parameterized tests.\nHowever, in its out-of-the-box version, GoogleTest is not suitable for testing MPI-parallel software.\nMPI (Message Passing Interface: https://www.mpi-forum.org/) is the de-facto standard in the HPC community for writing software that runs on supercomputers.\nEmploying a unit test framework that is unaware of the parallelism leads to incorrect test results and deadlocks.\nIn our talk we discuss the challenges occurring when testing distributed-parallel software and how we address them in our GoogleTest-MPI library (https://github.com/DLR-SC/googletest_mpi).\nThis extension to GoogleTest introduces the missing features to make it usable by MPI-parallelized codes.\n\nAuthors:\nMelven Roehrig-Zoellner, Johannes Holke", "name": "Melven Röhrig-Zöllner", "institution": "German Aerospace Center (DLR)", "format": "Talk"}, "T1020": {"title": "The highs and lows of building a data sharing platform for funders", "abstract": "Are there gender biases in research funding? Do these biases differ between scientific fields or application type? What is contributing to inequality in funding success rates? \n\nThe Research on Research Institute, an international consortium of funders, researchers and technologists, are attempting to answer these questions through the CRITERIA project. As part of this project, we at the Wellcome Trust, have been building a Funder Data Platform to securely share and analyse data from multiple funders. In this talk I’ll go through the highs and lows of developing such a platform, what we’ve achieved and how we dealt with challenges related to sharing highly sensitive, personal data. Finally I’ll share what the future plans are for the platform and what impact it has had across Wellcome and other funders.\n", "name": "Teri Forey", "institution": "Wellcome Trust", "format": "Talk"}, "T1023": {"title": "Open Source Initiative for Perfusion Imaging (OSIPI): a global collaboration of researchers committed to improving software in their field", "abstract": "Perfusion magnetic resonance imaging (MRI) refers to a group of techniques that aim to quantify tissue blood flow. Such techniques can produce more informative measures of tissue function than standard imaging, with applications in discovery science, drug development and clinical practice. However, complex data acquisition and analysis pipelines make reproducibility of results a challenge, which in turn limits the reliability of clinical research and slows the translation of research tools into clinical decision making. \n\nIn 2018, perfusion MRI researchers (scientists and clinicians) recognized the need to improve reproducibility in perfusion MRI, leading to the establishment of the Open Source Initiative for Perfusion Imaging (OSIPI). Launched in December 2019, OSIPI is a community-led collaboration with a mission to promote open access resources for perfusion imaging research. Now in its third year, OSIPI features contributions from more than 50 researchers from institutions across the world. Contributors to OSIPI have a range of software development backgrounds, from scientists who code but have minimal software engineering skills to experienced RSEs. \n\nIn this talk we highlight how OSIPI’s organisational structure brings together a diverse group of researchers, the challenges we have faced, the successes we have achieved so far, and our goals for the future. In doing so, we aim to bring awareness of OSIPI to the wider RSE community, and hope to hear from researchers working in similar initiatives in different fields, or from anyone that feels their research area would benefit from an OSIPI-like community collaboration.\n\nFor more information on OSIPI, see https://www.osipi.org/.", "name": "Michael Berks", "institution": "University of Manchester", "format": "Talk"}, "T1024": {"title": "Secure Data Analysis in the Cloud", "abstract": "Secure environments are an essential prerequisite for any analysis of sensitive datasets, both to comply with legal and contractual requirements and to retain the confidence and consent of data providers. We have developed a cloud-based secure environment which is open-source and fully scripted, allowing anyone to deploy their own version of our environment with minimal effort.", "name": "James Robinson", "institution": "The Alan Turing Institute", "format": "Talk"}, "T1025": {"title": "Senior Level RSE career paths (with an s)", "abstract": "Over the past nine years there has been growing acceptance of the role of RSEs and the value they bring to projects. We've also talked about different models for where RSEs can fit in institutions, from lone RSEs working with research groups, to small groups of RSEs embedded in a department or division, to centralized groups of RSEs in an institution. And in some institutions, these groups have grown to a size where additional structure beyond just a group and a leader is sufficient.\n\nNow it's time to define how RSEs fit into their institutions, particularly at more senior levels. In this talk, I'll propose a branching path that starts with technical skills, adds leadership, and then moves in different directions, both technical (project-focused) and management (product-focused, people-focused), which in turn can lead to more senior roles with little hands-on RSE work for those who want to progress in this way, for example, leading large infrastructure projects or divisions or departments. I believe that as the idea of RSEs matures, this is our next needed step: to define these more senior roles for individual RSEs to aspire and aim to, as a step of attracting new RSEs to our organizations by giving them a set of possible futures.", "name": "Daniel S. Katz", "institution": "University of Illinois at Urbana-Champaign", "format": "Talk", "name1": null, "institution1": null, "name2": null, "institution2": null}, "T1026": {"title": "Introducing the New RSE Society Mentorship Scheme:  Why and How to be Involved", "abstract": "The success of the RSE community owes a lot to the enthusiastic and open way RSEs have supported each other to develop the role and bring it to new audiences. This includes sharing evidence banks for people wishing to set up RSE groups, mentorship from peers and more experienced RSEs at workshops, and sharing ideas through the International Council of RSE. The new RSE Society mentorship scheme, which will match RSEs with mentors in the community, is a natural next step. \n\nIn this talk we’re very excited to share more details about the new RSE mentorship scheme which will launch this year.  We will outline how the scheme will work and how joining as a mentee -- or a mentor -- can be great for your career.", "name": "Ania Brown", "institution": "University of Southampton", "format": "Talk"}, "T1027": {"title": "Project Odysseus - From air pollution forecasts to helping local authorities navigate London's COVID-19 lockdowns", "abstract": "The talk will explore how a team of RSEs and researchers at the Alan Turing Institute transitioned from forecasting air pollution in London to helping local authorities respond to the COVID-19 lockdowns. Prior to March 2020, the team were developing high-resolution air pollution forecasts in collaboration with the Greater London Authority (GLA) and Transport for London (TfL). When the UK government announced the first nationwide lockdown on the 23rd March 2020, the local authorities realised they needed to understand activity levels across the city to help guide interventions and aid social distancing. The Turing team were already monitoring traffic data across the city to understand how emission levels from vehicles were affecting air pollution, including data from traffic cameras and 11,000+ inductive loop sensors placed under London's roads. Joined by RSEs and researchers from Warwick, Cambridge University and UCL, they repurposed the existing infrastructure to measure pedestrian activity, scaled the system to handle real-time data from TfL's 900+ traffic cameras, and provided measurements of social distancing to GLA and TfL via APIs and dashboards. The talk will reflect on the factors that led to the project's success including data readiness, scalable infrastructure and the ability to convene a multi-institutional RSE team, and explore the technical challenges in rapidly repurposing and scaling existing cloud infrastructure.", "name": "Oscar Terence Giles", "institution": "Alan Turing Institute", "format": "Talk"}, "T1030": {"title": "The Turing Way Guide to Reproducible, Ethical and Collaborative Research", "abstract": "As researchers, we make complex choices around project design and decision-making throughout the lifecycle of our research. We are expected to ensure that our research objects are easily accessed, openly examined and built upon by others in future work. Although open and transparent reporting helps to make sure that scientific work can be trusted, we must also integrate considerations of the societal and ethical implications of our work. Especially when these considerations impact people's lives. Furthermore, reproducible research practices are important for enabling independent verification of research methods, underlying data, analysis code and workflows. All these require an understanding of research best practices and skills that are often not widely taught or explored among academic researchers. \n\nIn this talk, I will introduce The Turing Way - an open source community-driven guide to reproducible, ethical and inclusive data science and research. Our goal is to provide all the information that researchers, industry professionals and community leaders need at the start of their projects to ensure that they maintain the highest reproducible and ethical standards at all stages of development. All attendees will leave the talk understanding the many dimensions of openness and how they can participate in an inclusive, kind and inspiring open source ecosystem as they collaboratively seek to improve research culture. All questions and contributions are welcome at GitHub repository: https://github.com/alan-turing-institute/the-turing-way.", "name": "Malvika Sharan", "institution": "The Alan Turing Institute", "format": "Talk"}, "T1031": {"title": "The R & RSE Communities: Strengthening Each Other", "abstract": "At useR! 2021, the main conference of the R community, R users and developers gathered in an incubator session to discuss \"The role of the R community in the RSE movement\". Participants discussed topics in small groups such as: How can we promote RSE career paths?, What should a book \"Research Software Engineering with R\" contain?, and How to show off what R is doing well?. This talk will report back on some of the ideas that came out of the incubator session, what has happened since and how we can take some of these ideas forward, for the benefit of both the R and RSE communities.", "name": "Heather Turner", "institution": "University of Warwick", "format": "Talk"}, "T1033": {"title": "CROP - building a digital twin for an underground farm from the ground up", "abstract": "We present the development of “CROP”, a digital twin prototype of a second world war air raid bunker re-purposed as an underground urban farm and located 33 metres below the busy streets of London.  CROP benefits from collecting and visualising heterogeneous IoT sensor and facility management data, 3D representation of the underground farm, virtual tours, and predictive modelling amongst other features, which enable urban farmers and scientists to digest multiple streams of data and speed up decision making. The development of CROP is a collaboration between the RSE in the Alan Turing Institute, Cambridge university and Growing Underground and demonstrates a real-world example of how to build a digital twin, from underground, to the cloud.", "name": "Flora Roumpani", "institution": "The Alan Turing Institute", "format": "Talk"}, "P1002": {"title": "SciKit-Surgery: Compact Libraries for Surgical Navigation. What's New?", "abstract": "We follow up on our previous presentations on the SciKit-Surgery libraries with an update on new developments and discussion about the ongoing development process. The SciKit-Surgery libraries are open source Python libraries aimed at applications in surgical navigation. SciKit-Surgery is intended to be compact, atomic and orthogonal, so that each library does one thing and does it well. They should be well tested and near production ready, so that researchers can quickly translate their work to the clinic. This poster will review progress over the last 18 months and attempt to assess how well the libraries are meeting their objectives. This will include the following:\n-> An analysis of the code base and the level of CI testing. (Are they still compact and well tested?)\n-> An attempt to measure the impact of the libraries, (citations, GitHub metrics, contributors, and others)\n-> A discussion of our impact and dissemination strategy.\n-> Future directions for SciKit-Surgery.", "name": "Stephen Thompson", "institution": "UCL", "format": "Poster"}, "P1004": {"title": "How to do AI Bioscience Research during a pandemic using RSE skills", "abstract": "A former RSE, turned AI / bioscience PhD student tries to continue his research during the Covid-19 Pandemic. I'll explain the problem we are looking into and how I managed to work remotely using a number of technologies and skills I learned as a software engineer, and how interdisciplinary work is both challenging and rewarding, even when you are remote.", "name": "Benjamin James Blundell", "institution": "King's College London", "format": "Poster"}, "P1005": {"title": "Using LuaTeX for elegant scientific typesetting", "abstract": "LaTeX - the old typesetting system - have been widely used in academia, yet many astute users may find the system frustrating. There is no easy way to modify the default layout, and defining macro is a nightmare to beginners. In most cases, users have to search for packages to customise the document's behaviour. Enter LuaTeX, a TeX-based computer typesetting system [...] with a Lua scripting engine embedded (from Wikipedia). Using LuaTeX, you can write cleaner code to add various dynamic content to your LaTeX documents, such as calculation and geometry!", "name": "Nguyen Quang Chien", "institution": "Aberystwyth University", "format": "Poster"}, "S1002": {"title": "Launch Event of the UK Regional RSE Groups SIG", "abstract": "This session marks the launch of the new Regional RSE Communities Special Interest Group (SIG) that is supported by the Society of Research Software Engineering. Regional research software communities bridge the gap between local communities and the national community. They provide a crucial opportunity to engage more researchers and RSEs with the RSE movement, offer them support, networking and training, and ultimately contribute to enhancing the quality of research software and the skills-base of the RSE community.  \n\nA small number of regional RSE networks already exist. These have been developed in an ad hoc manner across various regions of the UK.  These regional communities have the opportunity to engage with and build connections between both smaller local groups and institutions as well as the larger organisations that may already have local RSE communities. Regional networks allow more focused and targeted engagement than is often possible on a national scale, and we believe that they are vital in supporting the long-term health and sustainability of RSE communities across the UK as the RSE movement continues to grow.\n\nIn this workshop we will look at the case for the development of regional RSE groups, explore how existing groups started and what they offer, and ask for feedback as to whether there is a desire to develop more regional groups. We will gather ideas from the attendees about what contributions could be useful in supporting their development.  Following some initial short presentations to set the scene, the breakout session will include a set of groups each focusing on a different region of the UK. There will be an icebreaker and a brainstorming session to find out what that members of each breakout group would like to see from a regional community and how the Regional RSE Communities Special Interest Group can help make that happen. \n", "name": "Claire Wyatt", "institution": "Software Sustainability Institute/University of Southampton", "format": "Workshop", "requirements": null}, "S1003": {"title": "Design for Change - Software Engineering to the rescue", "abstract": "A major reason for the instability of software is that it is subject to continuous change. This is especially true for software in the scientific context, since the scientific discourse is open-ended. Change has caused difficulties for scientific software developers from the very beginning and it continuous to do so. In parallel, the software engineering community has produced numerous developments that we as research software developers can take advantage of to significantly support our work. This workshop tries to bridge the gap between both worlds and to show practices, methods and principles to develop maintainable software and to make the software development process sustainable. If you have not heard of SOLID principles, design patterns and TDD, this workshop is for you.", "name": "Dr. Jan Linxweiler", "institution": "Technische Universität Braunschweig", "format": "Workshop", "name1": null, "institution1": null, "name2": null, "institution2": null, "requirements": "Please could install Visual Studio Code, ideally with the live stream extension."}, "S1004": {"title": "Open Source Research Software: Defining and Showcasing the Good", "abstract": "There's more to making your work open source than simply putting it online, but there are also lots of things that get in the way. What would a MVP for open source software look like? In this collaborative workshop, participants will discuss what we talk about when we talk about good quality open software. During the 90 minute session, participates will be spilt into breakout groups that will cover each of our three themes: getting started, open enough, supportive culture. From these conversations, participants will work together to co-create a set of guidelines, definitions and collation of existing resources, highlighting what good quality and good enough open software means to the community.", "name": "Yo Yehudi", "institution": "Wellcome Trust, University of Manchester ", "format": "Workshop", "name1": null, "institution1": null, "requirements": null}, "S1005": {"title": "FLAME GPU 2: Complex Systems Simulation using GPUs", "abstract": "FLAMEGPU2 is a framework for developing highly parallel complex system simulations, allowing modellers to write their models using C++/Python without an explicit understanding of CUDA or GPU optimisation strategies. The framework is under active development by members of the University of Sheffield’s RSE team. The software currently underpins exciting research into crowd modelling under social distancing, simulation of tumour growth in cancer research, and modelling of the immune system.\n\n\nThe multi-agent approach to modelling is extremely powerful in a wide range of domains as diverse as computational biology to economics and physics. Whilst multi-agent modelling provides a natural and intuitive method to model complex systems the computational cost of performing large simulations is much greater than for top-down, system level alternatives. \n\nFLAMEGPU provides a high-level API for defining complex system simulations in either C++ or Python. This allows greater accessibility to modellers with domain specific knowledge, without requiring an understanding of writing optimised GPU parallel code. Hence, models can be scaled up and executed faster providing greater quality results. This lets users focus on correctness rather than performance while developing the model, whilst the increased performance means more simulation runs for more reliable and reproducible data.\n\nThis tutorial will allow attendees to experience the ease with which models can be defined and executed using FLAME GPU 2 and see first hand  the performance and scalability of GPU modelling techniques.\n\nThe tutorial format is an introductory lecture followed by participants being provided the opportunity to complete a hands-on exercise implementing a model using the FLAME GPU 2 software. Participants will be provided dedicated GPU cloud resources for interactively configuring and running a large scale agent-based model within FLAME GPU 2.\n", "name": "Paul Richmond", "institution": "University of Sheffield", "format": "Workshop", "name1": "Matthew Leach", "institution1": "University of Sheffield", "name2": "Peter Heywood", "institution2": "The University of Sheffield", "name3": "Robert Chisholm", "institution3": "University of Sheffield", "requirements": null}, "S1007": {"title": "Turing Data Stories: try your hand at writing your own data story!", "abstract": "Turing Data Stories* is an open source and open community project with the goal of developing a platform that enhances the understanding of the world around us through “Data Stories”: an interactive mix of narrative, code, and visuals that derives insight from real world open data\n\nThe Turing Data Stories are written as pedagogic Jupyter notebooks that aim to spark curiosity and motivate more people to play with data. In this workshop participants will have the chance to contribute to the project by starting the process of writing their own data story!\n\n*https://github.com/alan-turing-institute/TuringDataStories/\n\nNote: This submission has been written by Camila Rangel Smith and Sam Van Stroud on behalf of the Turing Data Stories team. We will be both responsible of designing and running this event. \n", "name": "Camila Rangel Smith", "institution": "The Alan Turing Institute", "format": "Workshop", "name1": "Kevin Xu", "institution1": "UK Government", "name2": "Sam Van Stroud", "institution2": "UCL", "name3": "William Finnegan", "institution3": "Oxford University", "name4": "David Beavan", "institution4": "The Alan Turing Institute", "name5": "Helen Duncan", "institution5": "The Alan Turing Institute", "name6": "Luke Hare", "institution6": "The Alan Turing Institute", "name7": null, "institution7": null, "requirements": "Please ensure that you can run Jupyter notebooks from within a conda environment."}, "S1008": {"title": "The RSE Landscape: Understanding role diversity across the community", "abstract": "Software is integral to research, yet those whose job it is to create and maintain that software can come from a variety of places and can follow very different career paths. As the Society of Research Software Engineering our aim is to represent and support RSEs across the breadth of the RSE landscape. As part of this we want to better understand the diversity of RSE and RSE-type roles and career pathways across the research landscape. We also hope to learn more about groups of individuals who do not necessarily consider themselves to be RSEs but who might benefit and appreciate becoming a part of our community.\n\nIn this workshop we’ll run a series of interactive activities and breakout sessions to explore how attendees would classify themselves, and others, within the RSE landscape. This workshop is a successor to the mini-workshop we ran at the Collaborations Workshop earlier this year, a summary of which can be found here https://society-rse.org/the-rse-landscape/", "name": "Teri Forey", "institution": "Wellcome Trust", "format": "Workshop", "requirements": null}, "S1009": {"title": "Open Reproducible Research in the Cloud", "abstract": "We will run a distributed, hybrid, in-person/remote, gamified workshop where attendees explore using AWS to deploy a reproducible analysis from examples in the registry of open data. Teams will be tasked with recreating example workflows, deploying the infrastructure and running analysis. Inspired by the reprohack model, can you take open data, create or reuse reproducible analysis and add in redeployable, democratised infrastructure? Prizes will be awarded e.g. for fastest and most elegant solution. AWS accounts and/or platforms for deploying infrastructure will be provided to teams and we will provide an overview to help novices get started. While knowledge and experience of cloud will be useful, some programming experience, an appetite to learn, and curiosity are the only pre-requisites. We positively encourage registrations from teams drawn from across the research spectrum, researchers, from RSEs and Research Compute teams. As well as having fun can we get out of our silos after recent challenges. Everything will be run subject and according to whatever COVID rules are in place at the time. With this in mind we currently envisage that teams of up to five will be supported by a solutions architect at six locations across the country in addition to our offices in London, we will provide lunch and evening meal. We also intend to have solution architects available virtually to support a number of teams joining remotely if they are unable to or would prefer not to attend in person. The social aspect will provide plenty of time for discussion about how to apply what you’ve explored in your own research workloads.\n\nFor more information, and to attend, please sign up here: https://aws-septembrse-workshop.splashthat.com", "name": "James Grant", "institution": "Amazon Web Services/University of Bath", "format": "Workshop", "requirements": null}, "S1011": {"title": "Build and deploy an interactive Python data app with Streamlit", "abstract": "Streamlit makes it easy to build and deploy data visualisations and other interactive apps written in pure Python. This workshop will walk through creating and deploying a dashboard displaying graphs, data tables, and text, with interactive elements such as sliders, numeric textboxes, and checkboxes.", "name": "Fergus Cooper", "institution": "University of Oxford", "format": "Workshop", "requirements": "Please ensure that you have Python >= 3.6 installed, as well as Git, and that you have a GitHub account."}, "W1001": {"title": "How to set up a Python web application: Django beyond the tutorial", "abstract": "Creating web applications to analyse and share research is a RSE skill that’s increasingly in demand, but can seem very intimidating to beginners. In this walkthrough I’ll demonstrate just how easy it is to get a web application up and running using the ‘batteries-included’ web framework Django. As well as the initial setup I’ll also include steps beyond the tutorial such as modifying the user model and combining npm and bootstrap into your project. These steps come from not only my own personal experience of working with Django as an RSE, but also from numerous discussions and blog posts within the Django community.", "name": "Teri Forey", "institution": "Wellcome Trust", "format": "Walkthrough"}, "W1004": {"title": "Creating your very own pet Cluster in the Cloud", "abstract": "Cluster in the Cloud is a tool for creating easy, scalable and heterogeneous compute clusters in public clouds. Supporting AWS, Google and Oracle, you can be submitting jobs within 10 minutes.\n\nThis walkthrough will show you the process of creating a cluster from scratch, explaining how the software works and, time permitting, running some jobs at the end.", "name": "Matt Williams", "institution": "University of Bristol", "format": "Walkthrough"}, "W1005": {"title": "SunPy: coding to analyse signals from the Sun", "abstract": "The SunPy library provides various modules for the conversion and transformation of electromagnetic signals emitted from the Sun. It is widely used among astrophysical research communities. However, it is also a valuable tool to experiment with high-volume data. In this walkthrough, I will demonstrate some common ways to explore these solar data resources.", "name": "Nguyen Quang Chien", "institution": "Aberystwyth University", "format": "Walkthrough"}, "W1006": {"title": "Cookiecutters for new and existing research software projects", "abstract": "It is well-known that good software engineering practices in research software\nlag well behind the standard in industry or commercial enterprise. The reasons\nfor this are complex, but two contributing factors are lack of awareness and\ntime. [Cookiecutter](https://cookiecutter.readthedocs.io/en/stable/), a\npopular command-line utility for generating project content from templates, can\nhelp partially alleviate these issues by offloading decisions about project\nstructure and tools from the researcher. This walkthrough will demonstrate two\nuse cases of cookiecutter from the bash shell:\n\n1. Starting a scientific software project in Python from scratch\n2. Migrating an existing project into a cookiecutter-generated skeleton while\n   retaining git history.\n\nThe cookiecutter used for these examples had been modified from \n[the Scientific Python Cookiecutter\nTemplate](https://nsls-ii.github.io/scientific-python-cookiecutter/index.html).\nAlthough this walkthrough uses Python, the principles are equally\napplicable to other programming languages for which there are cookiecutters\nreadily available.", "name": "Matthew Bluteau", "institution": "UKAEA", "format": "Walkthrough"}, "W1008": {"title": "What's the deal with Python wheels?", "abstract": "If you've ever installed a Python package, you've used them before.\nPython wheels are the recommended format for distribution python code.\nThey allow for a safer, faster easier installation of Python packages.\nBut do you know how wheels are made?  Could you tell the difference\nbetween wheels and other distribution formats like sdists and eggs?\nDo you know what \"manylinux\" means?\n\nThis walkthrough will take you on a tour of the Python wheel format.\nParticularly, we will illustrate how Python wheels come ready to install,\neffectively bypassing the need to run any setup script or to compile\nextension module(s).  This makes scientific packages that rely on\nC/C++/Fortran libraries much more accessible, as users do not require\nto compile the package themselves.  This walktrough will demonstrate\nhow to build a self-contained wheel with compiled modules and their\nlibrary dependencies. Finally, we'll have a glance at how you can\nautomate wheel building for several Python versions, on various\nplatforms, using cibuildwheel.", "name": "Thibault Lestang", "institution": "University of Oxford", "format": "Walkthrough"}, "L1001": {"title": "Missing narratives in discussions around diversity and inclusion in research software engineering", "abstract": " An inclusive community values diversity at all levels, promotes equitable access to resources and engages its members in decision-making processes, especially when those decisions affect their lives. This panel discussion will encourage adoption of this action-laden definition of an inclusive RSE community by centering on intersectional voices. We will use this opportunity to raise awareness of power imbalances in academia that negatively impact multiple marginalised groups in research, and provide a call-to-action for diversity and inclusion. \nThe panel discussion will aim to highlight important issues and challenges related to diversity, accessibility and belonging that the RSE community would benefit from learning about, discussing and collaborating on. With this goal in mind, the panel organisers will bring together experts who lead different efforts for improving diversity, equity and inclusion in academia, for example, training, policy development and data-led research. Among other topics, we hope to discuss disability, mental health, representation of the Global South in RSE efforts and mentorship support for members from marginalised communities.", "name": "Malvika Sharan", "institution": "The Alan Turing Institute", "format": "Panel", "name1": "Rowland Mosbergen", "institution1": "WEHI", "name2": "Jeremy Cohen", "institution2": "Imperial College London", "name3": null, "institution3": null, "name4": "Yanina Noemí Bellini Saibene", "institution4": "Instituto Nacional de Tecnología Agropecuaria (INTA)", "name5": null, "institution5": null, "name6": "Alex Chan", "institution6": "Wellcome Collection"}, "L1002": {"title": "Exploring the RSE role in HPC, AI, and ML in emerging (and unconventional) fields", "abstract": "As the ability to capture and process data and imagery becomes easy and more accessible fields such as humanities and biological sciences are emerging ready to utilise HPC, AI, and ML services. Despite a rise in interest, these fields are facing barriers to entry due to their unconventional and often non-linear path from experimental methodology to scientific process. So how does the RSE help in bringing new fields into the computational fold? This panel will explore the role that RSEs can play in removing barriers, building up opportunities, and addressing the technical, resource, and skills sets needed to bring these fields in-line with established research… and maybe even improve upon systems already in place.\n\nFollowing the panel a KQ Codes Technical Social – hosted online by the UCL Advanced Research Computing group - will continue the discussion focusing on the sometimes daunting task of taking the first step into large-scale compute. This social is free to attend.  If you would like to register please follow this link: https://www.eventbrite.co.uk/e/kq-codes-technical-social-thu-23rd-sep-2021-hpc-ai-panel-discussion-tickets-170122020543?aff=ebdsoporgprofile", "name": "Cristin Merritt", "institution": "Alces Flight Limited", "format": "Panel", "name1": "Matthew Thomas West", "institution1": "University of exeter", "name2": null, "institution2": null, "name3": "Dairsie Latimer", "institution3": "Red Oak Consulting", "name4": null, "institution4": null, "name5": null, "institution5": null, "name6": null, "institution6": null}, "L1004": {"title": "Coding Confessions", "abstract": "What?\n\nAt a \"Coding Confessions\" event software developers talk openly about mistakes they've made when developing software.\n\nWhy?\n\nPeople don’t want to talk about their mistakes, publish code or submit it for review. Common reasons for this are fear that “my code isn’t good enough”, “isn’t complete enough”, “has mistakes in it”. We want to encourage people to share their coding insecurities to help normalise talking about mistakes and knowledge gaps.\n\nHow?\n\nThere will be two parts to the event: 1. A public panel where several established RSEs and software developers talk openly about mistakes they've made in software they've developed. 2. A public noticeboard (Google Document) for posting will be available through Gather Town for anybody else to submit a confession anonymously.  Ultimately we would like to publish a collection of confessions from both sources as blog posts. These will help highlight these mistakes and stop them being repeated by others.", "name": "Colin Sauze", "institution": "Aberystwyth University", "format": "Panel", "name1": "Eirini Zormpa", "institution1": "Delft University of Technology", "name2": "Yo Yehudi", "institution2": "Wellcome Trust, University of Manchester ", "name3": "Becky Arnold", "institution3": "University of Keele", "name4": "Patricia Herterich", "institution4": "Digital Curation Centre, University of Edinburgh"}, "L1005": {"title": "Meet the 2021 EPSRC/STFC RSE Fellows and hear about the Open Fellowship scheme!", "abstract": "Come along to this panel to hear from the 2021 EPSRC/STFC RSE Fellows where they will talk about their fellowship plans and how they were successful in this latest round. You can learn from their experiences of submitting a fellowship application and going through the interview process to apply these lessons learnt for your future success with the Open Fellowship scheme. \nThis session will be chaired by Paul Richmond who is an RSE Fellow (2016), President and trustee at the Society of Research Softare Engineering, Director of the RSE Group at the University of Sheffield.", "name": "Paul Richmond", "institution": "University of Sheffield", "format": "Panel", "name1": "Claire Wyatt", "institution1": "Software Sustainability Institute/University of Southampton", "name2": "Ed Bennett", "institution2": "Swansea University", "name3": "Andrew Brown", "institution3": "Queen's University Belfast", "name4": "Domhnall Carlin", "institution4": "Queen's University Belfast", "name5": "Thomas Dowrick", "institution5": "UCL", "name6": "Peter Hill", "institution6": "University of York", "name7": null, "institution7": null, "name8": "James C Knight", "institution8": "University of Sussex", "name9": "Heather Turner", "institution9": "University of Warwick"}, "D1001": {"title": "RSE2031: What could (and should) Research Software Engineering look like 10 years from now?", "abstract": "A talk-radio-like discussion on the topic of the next 10 years of Research Software Engineering, chaired by James C. Womack of the University of Bristol. Bios and short statements on the discussion topic from each of the participants can be found in the associated materials folder.", "name": "James C. Womack", "institution": "University of Bristol", "format": "Discussion", "name1": "Christopher Woods", "institution1": "University of Bristol", "name2": "Mozhgan Kabiri chimeh", "institution2": "NVIDIA", "name3": "Shashank Shekhar Harivyasi", "institution3": "University of Leeds", "name4": "Kim Martin", "institution4": "Stellenbosch University"}, "D1002": {"title": "Industrial Software Development Practices: Do they work in Academia? Should RSEs learn and use them?", "abstract": "A talk-radio-like discussion on the topic of industrial software development practices, chaired by Jeffrey Carver of the University of Alabama. Bios and short statements on the discussion topic from each of the participants can be found in the associated materials folder.", "name": "Jeffrey Carver", "institution": "University of Alabama", "format": "Discussion", "name1": "Ian David Cottam", "institution1": "Society of RSE", "name2": "Colin C. Venters", "institution2": "University of Huddersfield", "name3": "Ryan Alexander Pepper", "institution3": "University of Birmingham", "name4": "Mark Woodbridge", "institution4": "Imperial College London"}, "D1003": {"title": "Is testing overkill for most research software? How can we make it easier to test scripts?", "abstract": null, "name": "Graham Lee", "institution": "University of Oxford", "format": "Discussion", "name1": "Doug Mulholland", "institution1": "University of Waterloo, David R. Cheriton School of Computer Science", "name2": "Alison Clarke", "institution2": "Durham University", "name3": "Benjamin Mummery", "institution3": "STFC Hartree Centre"}, "D1004": {"title": "Python is ubiquitous in research, even when it is not the optimal option. When is it worth investing time in a more specialised but harder to learn/maintain programming language?", "abstract": "A talk-radio-like discussion on the topic of the widespread use of Python in research software and the utility of more specialised languages, chaired by Matt Williams of the University of Bristol. Bios and short statements on the discussion topic from each of the participants can be found in the associated materials folder.", "name": "Matt Williams", "institution": "University of Bristol", "format": "Discussion", "name1": "Nguyen Quang Chien", "institution1": "Aberystwyth University", "name2": "Thibault Lestang", "institution2": "University of Oxford", "name3": "Teri Forey", "institution3": "Wellcome Trust", "name4": "Jamie Quinn", "institution4": "University College London"}, "P1010": {"title": "#TeamRSE: How can we build and manage effective RSE teams?", "abstract": "A discussion poster. Feel free to add your thoughts to this poster, and to hold discussions on this topic around this poster board.", "name": null, "institution": null, "format": "Poster"}, "P1011": {"title": "Imposter Syndrome as an RSE: Neither a real Researcher, nor a qualified Software Engineer", "abstract": "A discussion poster. Feel free to add your thoughts to this poster, and to hold discussions on this topic around this poster board.", "name": null, "institution": null, "format": "Poster"}, "P1012": {"title": "Does identifying as a research software engineer dead-end an academic career?", "abstract": "A discussion poster. Feel free to add your thoughts to this poster, and to hold discussions on this topic around this poster board.", "name": null, "institution": null, "format": "Poster"}, "P1013": {"title": "What are good ways to write documentation for research software?", "abstract": "A discussion poster. Feel free to add your thoughts to this poster, and to hold discussions on this topic around this poster board.", "name": null, "institution": null, "format": "Poster"}, "P1014": {"title": "What I would’ve told my younger self - Advice to new RSEs on getting started in the field.", "abstract": "A discussion poster. Feel free to add your thoughts to this poster, and to hold discussions on this topic around this poster board.", "name": null, "institution": null, "format": "Poster"}, "P1015": {"title": "Coding Confessions", "abstract": "At a \"Coding Confessions\" event software developers talk openly about mistakes they've made when developing software. This poster provides a noticeboard and private space where you can disclose your confession.", "name": "Colin Sauze", "institution": "Aberystwyth University", "format": "Poster"}, "P1016": {"title": "UK Regional RSE Groups - Who is in your region?", "abstract": "Network with other RSEs in your region. Sign up to find out who the RSEs are in your region, and which groups are trying to join together.", "name": "Claire Wyatt", "institution": "Software Sustainability Institute/University of Southampton", "format": "Poster", "name1": "Jeremy Cohen", "institution1": "Imperial College London"}, "K1001": {"title": "Keynote Talk", "abstract": "James Hetherington is Director of the Centre for Advanced Research Computing at University College London. UCL ARC has a hybrid mission: to provide the computing, data, software and networking infrastructure and skills that empower computational science and digital scholarship across the university and its partners, and to deliver world-leading research in digital research infrastructures and their application. Prior to that, he was lead advisor on digital twins, mathematical, statistical and computational modelling, machine learning, research software engineering and trusted research environments to the Joint Biosecurity Centre, the quantitative analysis and assessment hub of the UK Coronavirus Response.", "name": null, "institution": null, "format": "Keynote"}, "K1002": {"title": "The stories we tell ourselves", "abstract": "Vanessa Sochat is a Computer Scientist in Lawrence Livermore National Lab and a research software engineer for over a decade. She received her PhD in Biomedical\nInformatics from Stanford University, and has done extensive work in Open Source developing container technologies, supporting tools, and fostering open source communities. She founded and hosts the Research Software Engineer Stories podcast and is an active member of the US Research Software Engineer Association, along with the Open Container Initiative. In her current role,\nshe is studying ABI compatibility in the context of containers and solvers. In her free time, Vanessa likes working on fun programming projects, learning new programming languages, running fast, and eating avocados.", "name": "Vanessa Sochat", "institution": "Lawrence Livermore National Lab", "format": "Keynote"}, "X1001": {"title": "Welcome to SeptembRSE", "abstract": "Welcome to SeptembRSE. This short talk will provide important information about the conference, including how the sessions will work, and giving a look ahead to all of the events and activities that will be running throughout the month. This includes information about the Oracle Cryptic Code Treasure Hunt!", "name": "Christopher Woods", "institution": "University of Bristol", "format": "Special event"}, "X1002": {"title": "Summary / wrap-up of Week 1", "abstract": "A wrap-up of Week 1, highlighting sessions you may want to re-stream, and providing an update on the Oracle Cryptic Code Treasure Hunt.", "name": "Christopher Woods", "institution": "University of Bristol", "format": "Special event"}, "X1003": {"title": "Welcome to Week 2 of SeptembRSE", "abstract": "Welcome to Week 2. This short talk will provide a summary of all of the events and sessions that will be taking place this week.", "name": "Christopher Woods", "institution": "University of Bristol", "format": "Special event"}, "X1004": {"title": "Summary / wrap-up of Week 2", "abstract": "A wrap-up of Week 2, highlighting sessions you may want to re-stream, and providing an update on the Oracle Cryptic Code Treasure Hunt.", "name": "Christopher Woods", "institution": "University of Bristol", "format": "Special event"}, "X1005": {"title": "Welcome to Week 3 of SeptembRSE", "abstract": "Welcome to Week 3. This short talk will provide a summary of all of the events and sessions that will be taking place this week.", "name": "Christopher Woods", "institution": "University of Bristol", "format": "Special event"}, "X1006": {"title": "Summary / wrap-up of Week 3", "abstract": "A wrap-up of Week 3, highlighting sessions you may want to re-stream, and providing an update on the Oracle Cryptic Code Treasure Hunt.", "name": "Christopher Woods", "institution": "University of Bristol", "format": "Special event"}, "X1007": {"title": "Welcome to Week 4 of SeptembRSE", "abstract": "Welcome to Week 3. This short talk will provide a summary of all of the events and sessions that will be taking place this week.", "name": "Christopher Woods", "institution": "University of Bristol", "format": "Special event"}, "X1008": {"title": "Society of Research Software Engineering Annual General Meeting", "abstract": "The AGM of the Society of Research Software Engineering", "name": "Paul Richmond", "institution": "University of Sheffield", "format": "Special event", "name1": "Claire Wyatt", "institution1": "Software Sustainability Institute/University of Southampton"}, "X1009": {"title": "Summary / wrap-up of SeptembRSE", "abstract": "A wrap-up of the entire conference, highlighting sessions you may want to re-stream, and awarding the Oracle Poster Prize and Oracle Cryptic Code Treasure Hunt Prize. Thanks to the entire conference organising committee and everyone who has worked tirelessly to make SeptembRSE a success!", "name": "Christopher Woods", "institution": "University of Bristol", "format": "Special event"}, "X1010": {"title": "EPSRC Software for Communities Call Q+A", "abstract": "Questions and answer session with the EPSRC about the Software for Communities funding call.", "name": "Michael James", "institution": "EPSRC", "format": "Special event"}, "P2001": {"title": "Poster and Sponsor Lightning Talks", "abstract": "Lightning talks from the poster presenters and sponsors. Includes updates on the developments in the discussions taking place in the Discussion Poster boards.", "name": null, "institution": null, "format": "Poster"}, "P2002": {"title": "Poster and Sponsor Lightning Talks", "abstract": "Lightning talks from the poster presenters and sponsors. Includes updates on the developments in the discussions taking place in the Discussion Poster boards.", "name": null, "institution": null, "format": "Poster"}, "P2003": {"title": "Poster and Sponsor Lightning Talks", "abstract": "Lightning talks from the poster presenters and sponsors. Includes updates on the developments in the discussions taking place in the Discussion Poster boards.", "name": null, "institution": null, "format": "Poster"}, "P2004": {"title": "Poster and Sponsor Lightning Talks", "abstract": "Lightning talks from the poster presenters and sponsors. Includes updates on the developments in the discussions taking place in the Discussion Poster boards.", "name": null, "institution": null, "format": "Poster"}, "X2001": {"title": "RSE Worldwide", "abstract": "SeptembRSE Worldwide is an open event that seeks to invite RSEs from around the globe and foster cross-border communication and collaboration. It is scheduled for the 22nd of September and would run in two sessions: 9:00-11:00 UTC (morning) and 13:00-15:00 UTC (afternoon).\nEstablished RSE Chapters from various countries/regions have been invited to both the sessions. The sessions will begin with a round of video messages from these Chapters followed by panel discussions. The first discussion (morning session) will be on \"Increasing Cross-Border Collaboration\" focusing on sharing of  information, expertise and other resources. The second discussion (afternoon session) will be on the topic: \"Lessons and Challenges of Promoting the Cause of Research Software Engineering\" in which the panelists will discuss the ups and downs of forming an RSE Chapter, with the hope that this will be useful for emerging Chapters. All attendees of SeptembRSE are invited to participate in the SeptembRSE Worldwide panel discussions as audience members. Non-attendess can request a live webinar link by registering at https://forms.gle/Pmq7TwHBHPUC7PrF6.", "name": "Heidi Perrett", "institution": "Ceres Tag Pty Ltd", "format": "Special event", "name1": null, "institution1": null, "name2": "Jan Philipp Dietrich", "institution2": "Potsdam Institute for Climate Impact Research (PIK)", "name3": "Marion Weinzierl", "institution3": "Durham University", "name4": "Claire Wyatt", "institution4": "Software Sustainability Institute/University of Southampton", "name5": "Paul Richmond", "institution5": "University of Sheffield"}, "X2002": {"title": "RSE Worldwide", "abstract": "SeptembRSE Worldwide is an open event that seeks to invite RSEs from around the globe and foster cross-border communication and collaboration. It is scheduled for the 22nd of September and would run in two sessions: 9:00-11:00 UTC (morning) and 13:00-15:00 UTC (afternoon).\nEstablished RSE Chapters from various countries/regions have been invited to both the sessions. The sessions will begin with a round of video messages from these Chapters followed by panel discussions. The first discussion (morning session) will be on \"Increasing Cross-Border Collaboration\" focusing on sharing of  information, expertise and other resources. The second discussion (afternoon session) will be on the topic: \"Lessons and Challenges of Promoting the Cause of Research Software Engineering\" in which the panelists will discuss the ups and downs of forming an RSE Chapter, with the hope that this will be useful for emerging Chapters. All attendees of SeptembRSE are invited to participate in the SeptembRSE Worldwide panel discussions as audience members. Non-attendess can request a live webinar link by registering at https://forms.gle/Pmq7TwHBHPUC7PrF6.", "name": "Heidi Perrett", "institution": "Ceres Tag Pty Ltd", "format": "Special event", "name1": null, "institution1": null, "name2": "Jan Philipp Dietrich", "institution2": "Potsdam Institute for Climate Impact Research (PIK)", "name3": "Marion Weinzierl", "institution3": "Durham University", "name4": "Claire Wyatt", "institution4": "Software Sustainability Institute/University of Southampton", "name5": "Paul Richmond", "institution5": "University of Sheffield"}, "X1011": {"title": "Society Address", "abstract": "The Society of Research Software Engineering welcomes you to SeptembRSE", "name": "Paul Richmond", "institution": "University of Sheffield", "format": "Special event"}, "X1012": {"title": "Society of Research Software Engineering Trustee Election Launch", "abstract": "With this session we launch the 2021 trustee elections for the Society of Research Software Engineering. Following pitches from this year's candidates, you will have the opportunity to decide who will help lead the Society as we continue to promote the importance of software in research and support the growing number of Research Software Engineers across the UK and internationally. Voting will be open until Tuesday 28th September, with the results being announced at our AGM on Thursday 30th September.", "name": "James Graham", "institution": "University of Southampton / Software Sustainability Institute / Society of Research Software Engineering", "format": "Special event"}, "B01": {"title": "LunchBytes × SeptembRSE Special: Python Virtual Environment Showdown", "abstract": "To coincide with this year’s online RSE conference, SeptembRSE, LunchBytes will be “colocating” on Zoom as part of the conference programme. All are welcome whether or not you’re attending the conference, or at The University of Sheffield, so tell your friends! This month’s topic will be a showdown between some of the different options for managing virtual environments when working with Python. Will Conda come out on top? Or will the favourite be venv or Poetry? Python is one of the most popular languages for research computing and virtual environments are a valuable method for managing dependencies within a project and ensuring a reproducible environment. There are lots of options around for virtual environment management in Python, in this special LunchBytes we’ll be exploring the pros and cons of some of them with help from members of the research software engineering community. [More information and sign up here](https://rse.shef.ac.uk/events/lunchbytes-2021-09-15.html)", "name": null, "institution": null, "format": "Blended event"}, "X1014": {"title": "A nice surprise", "abstract": "An extra surprise talk", "name": "James Grant", "institution": "AWS", "format": "Special event"}, "W1010": {"title": "Taking the “ninja” out of using GPU’s: Introducing the latest updates in the GrCUDA polyglot CUDA API", "abstract": "GPUs are readily available in cloud computing and personal devices, but their use for data processing acceleration has been slowed down by their limited integration with common programming languages such as Python or Java. Moreover, very few ninja programmers have the expert knowledge of asynchronous programming required to use GPUs at their best.\n\nThe GrCUDA polyglot API is a significant step forward in the never-ending quest of making GPU programming more accessible. GrCUDA exposes the CUDA API to all the high-level languages supported by GraalVM, such as JavaScript, R, Python, and Scala, drastically lowering the integration efforts with these languages. But that's not all: we have recently improved GrCUDA to transparently provide asynchronous execution, hardware space-sharing, and transfer-computation overlap without requiring in advance any information about the program dependency structure.\n\nWe achieve an average of 44% speedup against synchronous execution, with no code change whatsoever!\n\nIn this Demonstration/Walkthrough, we show the strengths of GrCUDA by showcasing a complex image processing application. But no fear: you will see how easy it is to accelerate JavaScript using GPUs, achieving the same performance as the low-level C++ CUDA API, with drastically simpler code!\n\nThis project is supported by an Oracle for Research Cloud Credit Grant and research funding from Oracle research Labs. We would like to thank Oracle Labs Co-Ordinator - Marco Arnaboldi <marco.arnaboldi@oracle.com> for his support.", "name": "Alberto Parravicini", "institution": "Politecnico di Milano", "format": "Walkthrough", "name1": null, "institution1": null, "name2": null, "institution2": null}, "X1020": {"title": "Another nice surprise", "abstract": null, "name": null, "institution": null, "format": "Special event"}}